cases/artigo_mestrado/on-caso-1.2/_grid_qin_fluid/P3000_d1e15/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       17216;
    }
    fsi_pia
    {
        type            wall;
        inGroups        1(wall);
        nFaces          960;
        startFace       17408;
    }
    fsi_dura
    {
        type            wall;
        inGroups        1(wall);
        nFaces          960;
        startFace       18368;
    }
    lid_wall_inner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       19328;
    }
    lid_wall_outer
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       19392;
    }
    outlet_peri
    {
        type            patch;
        nFaces          192;
        startFace       19456;
    }
)

// ************************************************************************* //
